Revit 2024 API
BuiltInFailures.FabricFailures.CoverOffsetTooLong Property
 Cover offset is greater than host thickness.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CoverOffsetTooLong { get; }
Visual Basic
Public Shared ReadOnly Property CoverOffsetTooLong As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CoverOffsetTooLong {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace